Revit 2027 API
Document.Print(ViewSet, Boolean) Method
Prints a set of views with default view template and default print settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Print(
	ViewSet views,
	bool useCurrentPrintSettings
)
Public Sub Print (
	views As ViewSet,
	useCurrentPrintSettings As Boolean
)
public:
void Print(
	ViewSet^ views,
	bool useCurrentPrintSettings
)
member Print :
        views : ViewSet *
        useCurrentPrintSettings : bool -> unit
Parameters
views ViewSet
The set of views which need to be printed.
useCurrentPrintSettings Boolean
If true, print the view with the current print setting, otherwise with the print setting of the document of the view.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view.
ArgumentNullException | Thrown when the view set to be printed is null.
ArgumentException | Thrown when the view set contains a null element.
ApplicationException | Thrown when at least one view from the view set could not be printed.
OperationCanceledException | Thrown when print is cancelled by event handler.
Remarks
If one view in the set can not be printed successfully then an exception will be thrown.
See Also
Reference
Document Class
Print Overload
Autodesk.Revit.DB Namespace